src/CF/Catalogs/Языки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Языки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяДляНаименованияОбъектов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяДляДокументов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяДляОбщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алфавит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/CommonForms/ФормаВыбораЯзыка/Ext/Form/Module.bsl
// sza150523-0202 
// sza150427-0009 иврит
// sza141112-1521
// sza141016-0102 :
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	ЗаконченаПервоначальнаяНастройка = Константы.ЗаконченаПервоначальнаяНастройка.Получить();
	Попытка	
		ЯзыкА = Справочники.Языки.English.ПолучитьОбъект();
		ЯзыкА.Комментарий 	= "English language EN";
		ЯзыкА.Наименование 	= "English - Английский (EN)";
		ЯзыкА.Записать();
	Исключение
		сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Убедитесь, что установлена версия платформы 1С не ниже 8.2.19 !"));
	КонецПопытки;
	
			Латиница = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Латиница");
			Другое = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Другое");
			Кирилица = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Кирилица");
			Иероглифы = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Иероглифы");
			
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.English").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Азербайджанский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Арабский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Другое;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Армянский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Другое;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Белорусский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Кирилица;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Болгарский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Кирилица;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Венгерский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Вьетнамский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Другое;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Грузинский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Другое;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Другой").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Кирилица;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Иврит").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Другое;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Итальянский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Казахский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Кирилица;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Китайский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Иероглифы;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Корейский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Иероглифы;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Латышский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Литовский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Немецкий").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Польский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Румынский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Русский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Кирилица;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Словацкий").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Таджикский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Тайский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Иероглифы;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Турецкий").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Узбекский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Украинский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Кирилица;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Французский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Хинди").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Другое;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Чешский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Эстонский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Латиница;
				ЭлементСправочника.Записать();
				
				ЭлементСправочника = ПредопределенноеЗначение("Справочник.Языки.Японский").ПолучитьОбъект();
				ЭлементСправочника.Алфавит = Иероглифы;
				ЭлементСправочника.Записать();
	
	ЯзыкУ = Справочники.Языки.Украинский.ПолучитьОбъект();
	ЯзыкУ.Комментарий 	= "Українська мова UA";
	ЯзыкУ.Наименование 	= "Українська - Ukrainian (UK)";
	ЯзыкУ.Записать();
	
	ЯзыкР = Справочники.Языки.Русский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Русский язык RU";
	ЯзыкР.Наименование 	= "Русский - Russian (RU)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Румынский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Român RO";
	ЯзыкР.Наименование 	= "Român - Румынский (RU)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Белорусский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Беларускі BL";
	ЯзыкР.Наименование 	= "Беларускі - Белорусский (BL)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Китайский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "中国的 ZH";
	ЯзыкР.Наименование 	= "中国的 - Китайский (ZH)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Болгарский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Български BG";
	ЯзыкР.Наименование 	= "Български - Болгарский (BG)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Казахский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Қазақ KK";
	ЯзыкР.Наименование 	= "Қазақ - Казахский (KK)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Немецкий.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Deutsch DE";
	ЯзыкР.Наименование 	= "Deutsch - Немецкий (DE)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Польский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Polski PL";
	ЯзыкР.Наименование 	= "Polski - Польский (PL)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Тайский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "ภาษาไทย  TH";
	ЯзыкР.Наименование 	= "ภาษาไทย - Тайский (TH)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Азербайджанский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Azərbaycan AZ";
	ЯзыкР.Наименование 	= "Azərbaycan - Азербайджанский (AZ)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Арабский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "العربية AR";
	ЯзыкР.Наименование 	= "العربية - Арабский (AR)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Армянский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "հայերեն AM";
	ЯзыкР.Наименование 	= "հայերեն - Армянский (AM)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Чешский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "čeština CS";
	ЯзыкР.Наименование 	= "čeština - Чешский (CS)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Венгерский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "magyar HU";
	ЯзыкР.Наименование 	= "magyar - Венгерский (HU)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Вьетнамский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "tiếng Việt VI";
	ЯзыкР.Наименование 	= "tiếng Việt - Вьетнамский (VI)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Грузинский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "ქართული KA";
	ЯзыкР.Наименование 	= "ქართული - Грузинский (KA)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Итальянский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "italiano IT";
	ЯзыкР.Наименование 	= "italiano - Итальянский (IT)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Корейский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "한국의 KO";
	ЯзыкР.Наименование 	= "한국의 - Корейский (KO)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Латышский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Latvijas LT";
	ЯзыкР.Наименование 	= "Latvijas - Латышский (LT)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Литовский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Lietuvos LV";
	ЯзыкР.Наименование 	= "Lietuvos - Литовский (LV)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Таджикский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "ทาจิกิสถาน YG";
	ЯзыкР.Наименование 	= "ทาจิกิสถาน - Таджикский (YG)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Турецкий.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Türk TR";
	ЯзыкР.Наименование 	= "Türk - Турецкий (TR)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Узбекский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "O'zbekiston UZ";
	ЯзыкР.Наименование 	= "O'zbekiston - Узбекский (UZ)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Французский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "français FR";
	ЯзыкР.Наименование 	= "français - Французский (FR)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Иврит.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "עִבְרִית HE";
	ЯзыкР.Наименование 	= "עִבְרִית - Иврит (HE)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Хинди.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "हिंदी HI";
	ЯзыкР.Наименование 	= "हिंदी - Хинди (HI)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Эстонский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "eesti ET";
	ЯзыкР.Наименование 	= "eesti - Эстонский (ET)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Японский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "日本人 JA";
	ЯзыкР.Наименование 	= "日本人 - Японский (JA)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Словацкий.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Slovenčina SK";
	ЯзыкР.Наименование 	= "Slovenčina - Словацкий (SK)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Другой.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Another ZZ";
	ЯзыкР.Наименование 	= "Another - Другой (ZZ)";
	ЯзыкР.Записать();
	
	ТекущийКодЛокализации = Врег(ТекущийКодЛокализации());
	ПоддерживатьИныеЯзыкиКромеРусского = Константы.ПоддерживатьИныеЯзыкиКромеРусского.Получить();
	Константы.ПоддерживатьИныеЯзыкиКромеРусского.Установить(ИСТИНА);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыберитеВашЯзыкПриИзменении(Элемент)
	ВыбранЯзык();
КонецПроцедуры

&НаКлиенте
Процедура ВыбранЯзык()
	
	Русский = ЗначениеЗаполнено(ВыберитеВашЯзык) И ВыберитеВашЯзык = ПредопределенноеЗначение("Справочник.Языки.Русский");
	
	Если НЕ Русский Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите, Локализация.. / Wait for localiZation.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите"));
	КонецЕсли;
	
	ОбновитьТекущийЯзыкИнтерфейса(ВыберитеВашЯзык);
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сменил язык интерфейса"), 2);
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьТекущийЯзыкИнтерфейса(Знач ВыберитеВашЯзыкБК = Неопределено)
	
	РусскийЯзык = ПредопределенноеЗначение("Справочник.Языки.Русский");
	Русский = ЗначениеЗаполнено(ВыберитеВашЯзыкБК) И ВыберитеВашЯзыкБК = РусскийЯзык;
	
	Если НЕ Русский Тогда
		
		ОбщийМодульТекстСервер.ЗагрузитьТекстыЯзыкаИзМакета("Макет" + ВыберитеВашЯзыкБК.Код, ВыберитеВашЯзыкБК);
		
		Если ВыберитеВашЯзыкБК = ПредопределенноеЗначение("Справочник.Языки.Украинский") Тогда
			
			Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").ПолучитьОбъект();
			Валюта.Наименование = "грн.";
			Валюта.Код = "980";
			Валюта.Записать();
			
		ИначеЕсли ВыберитеВашЯзыкБК = ПредопределенноеЗначение("Справочник.Языки.English")
			ИЛИ ВыберитеВашЯзыкБК = ПредопределенноеЗначение("Справочник.Языки.Китайский")
			ИЛИ ВыберитеВашЯзыкБК = ПредопределенноеЗначение("Справочник.Языки.Иврит")
			ИЛИ ВыберитеВашЯзыкБК = ПредопределенноеЗначение("Справочник.Языки.Тайский") Тогда
			
			Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").ПолучитьОбъект();
			Валюта.Наименование = "usd";
			Валюта.Код = "840";
			Валюта.Записать();
			
		ИначеЕсли ВыберитеВашЯзыкБК = справочники.Языки.Болгарский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Болгарский 
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Немецкий
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Венгерский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Итальянский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Латышский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Литовский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Французский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Чешский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Эстонский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Польский Тогда
			
			Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").ПолучитьОбъект();
			Валюта.Наименование = "eur";
			Валюта.Код = "978";
			Валюта.Записать();
			
		КонецЕсли;
		
		Константы.ТекущийЯзыкИнтерфейса.Установить(ВыберитеВашЯзыкБК);
		Константы.ПоддерживатьИныеЯзыкиКромеРусского.Установить(ИСТИНА);
		ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы = ВыберитеВашЯзыкБК;	
		ОбновитьПовторноИспользуемыеЗначения();
		
	Иначе
		Константы.ТекущийЯзыкИнтерфейса.Установить(РусскийЯзык);
		ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы = РусскийЯзык;
		Константы.ПоддерживатьИныеЯзыкиКромеРусского.Установить(ЛОЖЬ);
		
	КонецЕсли;      	
	
	ОбщийМодульСервер.ЗадатьНаименованияОбъектамНаДругомЯзыке(); // и в случае русского тоже
	
КонецПроцедуры 

&НаКлиенте
Процедура Русский(Команда)
	ВыберитеВашЯзык = ПредопределенноеЗначение("Справочник.Языки.Русский");
	ВыбранЯзык();
КонецПроцедуры

&НаКлиенте
Процедура Украинец(Команда)
	
	ВыберитеВашЯзык = ПредопределенноеЗначение("Справочник.Языки.Украинский");
	ВыбранЯзык();
	
КонецПроцедуры

&НаКлиенте
Процедура Англичанин(Команда)
	ВыберитеВашЯзык = ПредопределенноеЗначение("Справочник.Языки.English");
	ВыбранЯзык();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЯзык(Команда)
	
	ПараметрыОкна = Новый Структура;
	ФормаВыбораЯзыка = ПолучитьФорму("Справочник.Языки.ФормаВыбора", ПараметрыОкна);
	Язык = ФормаВыбораЯзыка.ОткрытьМодально();
	Если НЕ Язык = Неопределено Тогда
		ВыберитеВашЯзык = Язык;
		ВыбранЯзык();
	КонецЕсли;
	
КонецПроцедуры
